### BioBytes

### Importing the Library, Checking Version and Aliasing it

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

Knowing Version is important at times as you might find a solution for your problem on stackoverflow but it might be for a different version

### Reading CSV and other types of files

In [3]:
df = pd.read_csv('cooldata/csvdata.csv')

In [4]:
df

           DATE   INVCMRMT
0    1997-01-01  1301161.0
1    1997-02-01  1307080.0
2    1997-03-01  1303978.0
3    1997-04-01  1319740.0
4    1997-05-01  1327294.0
..          ...        ...
278  2020-03-01  2192351.0
279  2020-04-01  2178236.0
280  2020-05-01  2144828.0
281  2020-06-01  2125810.0
282  2020-07-01  2121991.0

[283 rows x 2 columns]

In [5]:
df2 = pd.read_excel('cooldata/exceldata.xlsx')

In [6]:
df2

        Year  Stocks T.Bills T.Bonds
0       1928  0.4381  0.0308  0.0084
1       1929  -0.083  0.0316   0.042
2       1930 -0.2512  0.0455  0.0454
3       1931 -0.4384  0.0231 -0.0256
4       1932 -0.0864  0.0107  0.0879
..       ...     ...     ...     ...
79      2007  0.0549  0.0988  0.0466
80      2008   -0.37  0.2587   0.016
81      2009  0.2646  -0.149   0.001
82       NaN  stocks  tbills   bonds
83  averages     NaN     NaN     NaN

[84 rows x 4 columns]

In [7]:
df3 = pd.read_csv('cooldata/tsvdata.tsv', sep = '\t') # We tell Pandas don't look for commas rather look for tab spaces

In [8]:
df3

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

## More about them here - 
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

### General Overview of Data

In [9]:
df.shape

(283, 2)

In [10]:
df.head() # You can see () after head as it is a function, head() is useful to see if the dataset has been loaded propely or not

         DATE   INVCMRMT
0  1997-01-01  1301161.0
1  1997-02-01  1307080.0
2  1997-03-01  1303978.0
3  1997-04-01  1319740.0
4  1997-05-01  1327294.0

In [11]:
df.head(3) # You can customize number of rows you want

         DATE   INVCMRMT
0  1997-01-01  1301161.0
1  1997-02-01  1307080.0
2  1997-03-01  1303978.0

In [12]:
df.tail() # Last view rows (5 by default)

           DATE   INVCMRMT
278  2020-03-01  2192351.0
279  2020-04-01  2178236.0
280  2020-05-01  2144828.0
281  2020-06-01  2125810.0
282  2020-07-01  2121991.0

In [13]:
df.columns # No () after columns as it is not a function but an attribute of the dataframe

Index(['DATE', 'INVCMRMT'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=283, step=1)

In [15]:
df.info() # Concise Summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 283 entries, 0 to 282
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DATE      283 non-null    object
 1   INVCMRMT  283 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.5+ KB

In [16]:
type(df)

pandas.core.frame.DataFrame

Let's say you have a dataframe and you want to use it with some other library but it does not support pandas dataframe objects, a simple way is to use the df.values and convert it into a numpy array

In [17]:
df.values

array([['1997-01-01', 1301161.0],
       ['1997-02-01', 1307080.0],
       ['1997-03-01', 1303978.0],
       ['1997-04-01', 1319740.0],
       ['1997-05-01', 1327294.0],
       ['1997-06-01', 1334688.0],
       ['1997-07-01', 1342310.0],
       ['1997-08-01', 1348243.0],
       ['1997-09-01', 1355839.0],
       ['1997-10-01', 1364970.0],
       ['1997-11-01', 1370492.0],
       ['1997-12-01', 1378022.0],
       ['1998-01-01', 1384404.0],
       ['1998-02-01', 1397707.0],
       ['1998-03-01', 1410167.0],
       ['1998-04-01', 1417122.0],
       ['1998-05-01', 1419449.0],
       ['1998-06-01', 1420897.0],
       ['1998-07-01', 1422905.0],
       ['1998-08-01', 1427365.0],
       ['1998-09-01', 1433847.0],
       ['1998-10-01', 1439499.0],
       ['1998-11-01', 1447969.0],
       ['1998-12-01', 1447814.0],
       ['1999-01-01', 1452973.0],
       ['1999-02-01', 1462122.0],
       ['1999-03-01', 1473310.0],
       ['1999-04-01', 1476429.0],
       ['1999-05-01', 1479614.0],
       ['1999-06-01', 1481030.0],
       ['1999-07-01', 1487323.0],
       ['1999-08-01', 1490333.0],
       ['1999-09-01', 1495805.0],
       ['1999-10-01', 1503112.0],
       ['1999-11-01', 1514635.0],
       ['1999-12-01', 1524132.0],
       ['2000-01-01', 1524001.0],
       ['2000-02-01', 1526667.0],
       ['2000-03-01', 1528547.0],
       ['2000-04-01', 1536838.0],
       ['2000-05-01', 1542432.0],
       ['2000-06-01', 1550692.0],
       ['2000-07-01', 1556524.0],
       ['2000-08-01', 1562943.0],
       ['2000-09-01', 1564299.0],
       ['2000-10-01', 1575214.0],
       ['2000-11-01', 1582264.0],
       ['2000-12-01', 1580917.0],
       ['2001-01-01', 1582741.0],
       ['2001-02-01', 1573301.0],
       ['2001-03-01', 1565421.0],
       ['2001-04-01', 1569481.0],
       ['2001-05-01', 1570708.0],
       ['2001-06-01', 1563177.0],
       ['2001-07-01', 1556460.0],
       ['2001-08-01', 1556143.0],
       ['2001-09-01', 1552602.0],
       ['2001-10-01', 1536333.0],
       ['2001-11-01', 1524347.0],
       ['2001-12-01', 1525165.0],
       ['2002-01-01', 1531528.0],
       ['2002-02-01', 1527437.0],
       ['2002-03-01', 1526330.0],
       ['2002-04-01', 1527589.0],
       ['2002-05-01', 1532081.0],
       ['2002-06-01', 1537610.0],
       ['2002-07-01', 1542296.0],
       ['2002-08-01', 1542090.0],
       ['2002-09-01', 1546915.0],
       ['2002-10-01', 1546331.0],
       ['2002-11-01', 1550656.0],
       ['2002-12-01', 1558272.0],
       ['2003-01-01', 1560578.0],
       ['2003-02-01', 1567829.0],
       ['2003-03-01', 1567763.0],
       ['2003-04-01', 1568316.0],
       ['2003-05-01', 1564403.0],
       ['2003-06-01', 1562940.0],
       ['2003-07-01', 1562001.0],
       ['2003-08-01', 1556297.0],
       ['2003-09-01', 1562025.0],
       ['2003-10-01', 1566433.0],
       ['2003-11-01', 1568729.0],
       ['2003-12-01', 1570539.0],
       ['2004-01-01', 1569042.0],
       ['2004-02-01', 1576929.0],
       ['2004-03-01', 1582863.0],
       ['2004-04-01', 1585653.0],
       ['2004-05-01', 1591503.0],
       ['2004-06-01', 1599200.0],
       ['2004-07-01', 1608600.0],
       ['2004-08-01', 1615741.0],
       ['2004-09-01', 1612955.0],
       ['2004-10-01', 1620774.0],
       ['2004-11-01', 1629938.0],
       ['2004-12-01', 1631021.0],
       ['2005-01-01', 1645553.0],
       ['2005-02-01', 1655465.0],
       ['2005-03-01', 1658874.0],
       ['2005-04-01', 1660685.0],
       ['2005-05-01', 1659607.0],
       ['2005-06-01', 1662317.0],
       ['2005-07-01', 1658649.0],
       ['2005-08-01', 1662692.0],
       ['2005-09-01', 1667928.0],
       ['2005-10-01', 1675844.0],
       ['2005-11-01', 1680516.0],
       ['2005-12-01', 1689169.0],
       ['2006-01-01', 1695662.0],
       ['2006-02-01', 1694174.0],
       ['2006-03-01', 1703497.0],
       ['2006-04-01', 1707158.0],
       ['2006-05-01', 1714176.0],
       ['2006-06-01', 1720314.0],
       ['2006-07-01', 1721834.0],
       ['2006-08-01', 1730258.0],
       ['2006-09-01', 1736178.0],
       ['2006-10-01', 1735465.0],
       ['2006-11-01', 1742619.0],
       ['2006-12-01', 1742696.0],
       ['2007-01-01', 1742199.0],
       ['2007-02-01', 1746527.0],
       ['2007-03-01', 1745838.0],
       ['2007-04-01', 1750582.0],
       ['2007-05-01', 1753264.0],
       ['2007-06-01', 1756731.0],
       ['2007-07-01', 1756867.0],
       ['2007-08-01', 1763164.0],
       ['2007-09-01', 1769841.0],
       ['2007-10-01', 1773728.0],
       ['2007-11-01', 1776207.0],
       ['2007-12-01', 1781578.0],
       ['2008-01-01', 1789818.0],
       ['2008-02-01', 1787911.0],
       ['2008-03-01', 1778978.0],
       ['2008-04-01', 1775600.0],
       ['2008-05-01', 1769829.0],
       ['2008-06-01', 1772317.0],
       ['2008-07-01', 1777256.0],
       ['2008-08-01', 1773966.0],
       ['2008-09-01', 1764426.0],
       ['2008-10-01', 1756904.0],
       ['2008-11-01', 1755209.0],
       ['2008-12-01', 1741177.0],
       ['2009-01-01', 1734667.0],
       ['2009-02-01', 1718820.0],
       ['2009-03-01', 1703226.0],
       ['2009-04-01', 1690786.0],
       ['2009-05-01', 1673611.0],
       ['2009-06-01', 1655462.0],
       ['2009-07-01', 1638480.0],
       ['2009-08-01', 1617107.0],
       ['2009-09-01', 1608198.0],
       ['2009-10-01', 1610476.0],
       ['2009-11-01', 1612759.0],
       ['2009-12-01', 1604026.0],
       ['2010-01-01', 1602743.0],
       ['2010-02-01', 1605271.0],
       ['2010-03-01', 1607725.0],
       ['2010-04-01', 1608913.0],
       ['2010-05-01', 1606114.0],
       ['2010-06-01', 1615168.0],
       ['2010-07-01', 1625366.0],
       ['2010-08-01', 1635130.0],
       ['2010-09-01', 1647697.0],
       ['2010-10-01', 1656675.0],
       ['2010-11-01', 1656120.0],
       ['2010-12-01', 1663852.0],
       ['2011-01-01', 1665177.0],
       ['2011-02-01', 1664173.0],
       ['2011-03-01', 1672664.0],
       ['2011-04-01', 1679090.0],
       ['2011-05-01', 1687537.0],
       ['2011-06-01', 1691018.0],
       ['2011-07-01', 1692266.0],
       ['2011-08-01', 1695545.0],
       ['2011-09-01', 1687894.0],
       ['2011-10-01', 1696715.0],
       ['2011-11-01', 1703512.0],
       ['2011-12-01', 1709421.0],
       ['2012-01-01', 1714925.0],
       ['2012-02-01', 1726169.0],
       ['2012-03-01', 1729963.0],
       ['2012-04-01', 1735732.0],
       ['2012-05-01', 1743584.0],
       ['2012-06-01', 1749502.0],
       ['2012-07-01', 1761306.0],
       ['2012-08-01', 1769266.0],
       ['2012-09-01', 1775178.0],
       ['2012-10-01', 1775242.0],
       ['2012-11-01', 1780540.0],
       ['2012-12-01', 1784009.0],
       ['2013-01-01', 1799869.0],
       ['2013-02-01', 1803481.0],
       ['2013-03-01', 1806109.0],
       ['2013-04-01', 1813121.0],
       ['2013-05-01', 1815245.0],
       ['2013-06-01', 1819522.0],
       ['2013-07-01', 1827709.0],
       ['2013-08-01', 1838062.0],
       ['2013-09-01', 1848087.0],
       ['2013-10-01', 1860310.0],
       ['2013-11-01', 1871121.0],
       ['2013-12-01', 1878653.0],
       ['2014-01-01', 1884483.0],
       ['2014-02-01', 1890844.0],
       ['2014-03-01', 1893923.0],
       ['2014-04-01', 1901124.0],
       ['2014-05-01', 1908092.0],
       ['2014-06-01', 1912524.0],
       ['2014-07-01', 1921453.0],
       ['2014-08-01', 1928057.0],
       ['2014-09-01', 1930589.0],
       ['2014-10-01', 1938554.0],
       ['2014-11-01', 1944816.0],
       ['2014-12-01', 1947203.0],
       ['2015-01-01', 1954906.0],
       ['2015-02-01', 1967795.0],
       ['2015-03-01', 1975742.0],
       ['2015-04-01', 1987557.0],
       ['2015-05-01', 1993371.0],
       ['2015-06-01', 2005310.0],
       ['2015-07-01', 2011272.0],
       ['2015-08-01', 2017750.0],
       ['2015-09-01', 2028458.0],
       ['2015-10-01', 2037127.0],
       ['2015-11-01', 2037636.0],
       ['2015-12-01', 2042724.0],
       ['2016-01-01', 2045270.0],
       ['2016-02-01', 2043474.0],
       ['2016-03-01', 2052727.0],
       ['2016-04-01', 2057515.0],
       ['2016-05-01', 2057006.0],
       ['2016-06-01', 2054929.0],
       ['2016-07-01', 2051079.0],
       ['2016-08-01', 2051927.0],
       ['2016-09-01', 2056007.0],
       ['2016-10-01', 2054770.0],
       ['2016-11-01', 2065930.0],
       ['2016-12-01', 2069867.0],
       ['2017-01-01', 2069616.0],
       ['2017-02-01', 2066881.0],
       ['2017-03-01', 2068191.0],
       ['2017-04-01', 2063455.0],
       ['2017-05-01', 2067188.0],
       ['2017-06-01', 2074142.0],
       ['2017-07-01', 2077863.0],
       ['2017-08-01', 2086790.0],
       ['2017-09-01', 2088135.0],
       ['2017-10-01', 2086084.0],
       ['2017-11-01', 2093438.0],
       ['2017-12-01', 2096385.0],
       ['2018-01-01', 2103620.0],
       ['2018-02-01', 2112722.0],
       ['2018-03-01', 2111511.0],
       ['2018-04-01', 2113456.0],
       ['2018-05-01', 2114511.0],
       ['2018-06-01', 2113749.0],
       ['2018-07-01', 2122281.0],
       ['2018-08-01', 2129534.0],
       ['2018-09-01', 2135205.0],
       ['2018-10-01', 2143767.0],
       ['2018-11-01', 2143229.0],
       ['2018-12-01', 2159894.0],
       ['2019-01-01', 2174287.0],
       ['2019-02-01', 2183374.0],
       ['2019-03-01', 2182942.0],
       ['2019-04-01', 2185718.0],
       ['2019-05-01', 2189679.0],
       ['2019-06-01', 2192017.0],
       ['2019-07-01', 2200394.0],
       ['2019-08-01', 2200320.0],
       ['2019-09-01', 2202122.0],
       ['2019-10-01', 2203476.0],
       ['2019-11-01', 2202134.0],
       ['2019-12-01', 2204873.0],
       ['2020-01-01', 2199503.0],
       ['2020-02-01', 2195308.0],
       ['2020-03-01', 2192351.0],
       ['2020-04-01', 2178236.0],
       ['2020-05-01', 2144828.0],
       ['2020-06-01', 2125810.0],
       ['2020-07-01', 2121991.0]], dtype=object)

In [18]:
type(df.values)

numpy.ndarray

## Helpful Docs for this section 

- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html
- https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html

Now you should have a good idea about how important docs are, a simple Google Search will also yield these results incasse you're stuck with a specific problem -

![Google Search](cooldata/gdoc.png)

### Accessing Columns

In [19]:
df.head()

         DATE   INVCMRMT
0  1997-01-01  1301161.0
1  1997-02-01  1307080.0
2  1997-03-01  1303978.0
3  1997-04-01  1319740.0
4  1997-05-01  1327294.0

In [20]:
df['DATE']

0      1997-01-01
1      1997-02-01
2      1997-03-01
3      1997-04-01
4      1997-05-01
          ...
278    2020-03-01
279    2020-04-01
280    2020-05-01
281    2020-06-01
282    2020-07-01
Name: DATE, Length: 283, dtype: object

In [21]:
df['DATE'].head() # Using Multiple Functions at Once

0    1997-01-01
1    1997-02-01
2    1997-03-01
3    1997-04-01
4    1997-05-01
Name: DATE, dtype: object

### How to get multiple columns?

In [22]:
df2

        Year  Stocks T.Bills T.Bonds
0       1928  0.4381  0.0308  0.0084
1       1929  -0.083  0.0316   0.042
2       1930 -0.2512  0.0455  0.0454
3       1931 -0.4384  0.0231 -0.0256
4       1932 -0.0864  0.0107  0.0879
..       ...     ...     ...     ...
79      2007  0.0549  0.0988  0.0466
80      2008   -0.37  0.2587   0.016
81      2009  0.2646  -0.149   0.001
82       NaN  stocks  tbills   bonds
83  averages     NaN     NaN     NaN

[84 rows x 4 columns]

In [23]:
df_subset = df2[['Year', 'Stocks']] # Pass a list of all the columns which you want

In [24]:
df_subset.head(2)

   Year  Stocks
0  1928  0.4381
1  1929  -0.083

### Accessing Rows

In [25]:
df.head(4)

         DATE   INVCMRMT
0  1997-01-01  1301161.0
1  1997-02-01  1307080.0
2  1997-03-01  1303978.0
3  1997-04-01  1319740.0

### Using loc

In [26]:
df.loc[2] # Picks Index from the index of the dataframe which matches the input parameter and not like the second value itself

DATE         1997-03-01
INVCMRMT    1.30398e+06
Name: 2, dtype: object

In [27]:
specdf = pd.read_excel('cooldata/loc.xlsx', index_col = 0) # index_col tells which col to use as index

In [28]:
specdf_loc # Special data to showcase loc

NameError: name 'specdf_loc' is not defined

In [ ]:
df_loc.loc[1] # As you can see you get all possible matches where index is 1

### Get Multiple Rows using loc

In [ ]:
df.loc[[0,11]] # Similar to getting multiple columns

### Using iloc (Index based matching instead of matching key to values in loc)

In [29]:
df.iloc[2]

DATE         1997-03-01
INVCMRMT    1.30398e+06
Name: 2, dtype: object

In [30]:
specdf

   A  B
0  2  3
1  4  5
2  4  4
3  3  4
1  2  3

In [31]:
specdf.iloc[1] #Now you get value at index 1 and not all places where index column value matches 1

A    4
B    5
Name: 1, dtype: int64

### ix is another way however since it is a deprecated practice it won't be covered you can read about it in the docs if you're interested

### Subsetting both columns and rows

In [32]:
df2.head()

   Year  Stocks T.Bills T.Bonds
0  1928  0.4381  0.0308  0.0084
1  1929  -0.083  0.0316   0.042
2  1930 -0.2512  0.0455  0.0454
3  1931 -0.4384  0.0231 -0.0256
4  1932 -0.0864  0.0107  0.0879

In [33]:
subset = df2.loc[:,['Year', 'Stocks']] # Before comma we add the rows. after comma we add the columns

In [34]:
subset.head()

   Year  Stocks
0  1928  0.4381
1  1929  -0.083
2  1930 -0.2512
3  1931 -0.4384
4  1932 -0.0864

In [35]:
advsubset = df2.loc[df2['Year']==1930, ['T.Bills', 'T.Bonds']] # Using booleans to check

In [36]:
advsubset

  T.Bills T.Bonds
2  0.0455  0.0454

In [37]:
df2['Year']==1930

0     False
1     False
2      True
3     False
4     False
      ...
79    False
80    False
81    False
82    False
83    False
Name: Year, Length: 84, dtype: bool

In [38]:
df2[df2['Year']==1930] # Returns those rows where there is a True

   Year  Stocks T.Bills T.Bonds
2  1930 -0.2512  0.0455  0.0454

### Using Multiple Boolean Conditions

In [39]:
df2[(df2['Year']==1929) & (df2['T.Bills'] == 0.0316)]

   Year Stocks T.Bills T.Bonds
1  1929 -0.083  0.0316   0.042

In [40]:
df2[(df2['Year']==1930) | (df2['T.Bills'] == 0.0316)]

   Year  Stocks T.Bills T.Bonds
1  1929  -0.083  0.0316   0.042
2  1930 -0.2512  0.0455  0.0454

### We use '&' and '|' over traditional python operators like 'and' and 'or' is because it does bitwise comparisons